xtruong91/cc2530f256/Components/mac/low_level/srf04/dual_chip/mac_radio_defs.h
/**************************************************************************************************
  Filename:       mac_radio_defs.h
  Revised:        $Date: 2014-06-03 09:28:17 -0700 (Tue, 03 Jun 2014) $
  Revision:       $Revision: 38773 $

  Description:    Describe the purpose and contents of the file.


  Copyright 2006-2014 Texas Instruments Incorporated. All rights reserved.

  IMPORTANT: Your use of this Software is limited to those specific rights
  granted under the terms of a software license agreement between the user
  who downloaded the software, his/her employer (which must be your employer)
  and Texas Instruments Incorporated (the "License").  You may not use this
  Software unless you agree to abide by the terms of the License. The License
  limits your use, and you acknowledge, that the Software may not be modified,
  copied or distributed unless embedded on a Texas Instruments microcontroller
  or used solely and exclusively in conjunction with a Texas Instruments radio
  frequency transceiver, which is integrated into your product.  Other than for
  the foregoing purpose, you may not use, reproduce, copy, prepare derivative
  works of, modify, distribute, perform, display or sell this Software and/or
  its documentation for any purpose.

  YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
  PROVIDED “AS IS” WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
  INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
  NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
  TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
  NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
  LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
  INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
  OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
  OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
  (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

  Should you have any questions regarding your right to use this Software,
  contact Texas Instruments Incorporated at www.TI.com.
**************************************************************************************************/

#ifndef MAC_RADIO_DEFS_H
#define MAC_RADIO_DEFS_H


/* ------------------------------------------------------------------------------------------------
 *                                            Includes
 * ------------------------------------------------------------------------------------------------
 */
#include "hal_mac_cfg.h"
#include "mac_dualchip.h"
#include "mac_dualchip_tx.h"
#include "mac_mcu_timer.h"
#include "mac_spi.h"
#include "mac_spec.h"


/* ------------------------------------------------------------------------------------------------
 *                                    Target Specific Defines
 * ------------------------------------------------------------------------------------------------
 */

/* strobe command registers */
#define SNOP                        0x00
#define IBUFLD                      0x02
#define SIBUFEX                     0x03
#define SSAMPLECCA                  0x04
#define SRES                        0x0F
#define MEMRD                       0x10
#define MEMWR                       0x20
#define RXBUF                       0x30
#define RXBUFCP                     0x38
#define RXBUFMOV                    0x32
#define TXBUF                       0x3A
#define TXBUFCP                     0x3E
#define RANDOM                      0x3C
#define SXOSCON                     0x40
#define STXCAL                      0x41
#define SRXON                       0x42
#define STXON                       0x43
#define STXONCCA                    0x44
#define SRFOFF                      0x45
#define SXOSCOFF                    0x46
#define SFLUSHRX                    0x47
#define SFLUSHTX                    0x48
#define SACK                        0x49
#define SACKPEND                    0x4A
#define SNACK                       0x4B
#define SRXMASKBITSET               0x4C
#define SMRMASKBITCLR               0x4D
#define RXMASKAND                   0x4E
#define RXMASKOR                    0x4F
#define MEMCP                       0x50
#define MEMCPR                      0x52
#define MEMXCP                      0x54
#define MEMXWR                      0x56
#define BCLR                        0x58
#define BSET                        0x59
#define CTR_UCTR                    0x60
#define CBCMAC                      0x64
#define UCBCMAC                     0x66
#define CCM                         0x68
#define UCCM                        0x6A
#define ECB                         0x70
#define ECBO                        0x72
#define ECBX                        0x74
#define ECBXO                       0x76
#define INC                         0x78
#define ABORT                       0x7F
#define REGRD                       0x80
#define REGWR                       0xC0

/* configuration registers */
#define FRMFILT0                    0x00
#define FRMFILT1                    0x01
#define SRCMATCH                    0x02
#define SRCSHORTEN0                 0x04
#define SRCSHORTEN1                 0x05
#define SRCSHORTEN2                 0x06
#define SRCEXTEN0                   0x08
#define SRCEXTEN1                   0x09
#define SRCEXTEN2                   0x0A
#define FRMCTRL0                    0x0C
#define FRMCTRL1                    0x0D
#define RXENABLE0                   0x0E
#define RXENABLE1                   0x0F
#define EXCFLAG0                    0x10
#define EXCFLAG1                    0x11
#define EXCFLAG2                    0x12
#define EXCMASKA0                   0x14
#define EXCMASKA1                   0x15
#define EXCMASKA2                   0x16
#define EXCMASKB0                   0x18
#define EXCMASKB1                   0x19
#define EXCMASKB2                   0x1A
#define EXCBINDX0                   0x1C
#define EXCBINDX1                   0x1D
#define EXCBINDY0                   0x1E
#define EXCBINDY1                   0x1F
#define GPIOCTRL0                   0x20
#define GPIOCTRL1                   0x21
#define GPIOCTRL2                   0x22
#define GPIOCTRL3                   0x23
#define GPIOCTRL4                   0x24
#define GPIOCTRL5                   0x25
#define GPIOPOLARITY                0x26
#define GPIOCTRL                    0x28
#define DPUCON                      0x2A
#define DPUSTAT                     0x2C
#define FREQCTRL                    0x2E
#define FREQTUNE                    0x2F
#define TXPOWER                     0x30
#define TXCTRL                      0x31
#define FSMSTAT0                    0x32
#define FSMSTAT1                    0x33
#define FIFOPCTRL                   0x34
#define FSMCTRL                     0x35
#define CCACTRL0                    0x36
#define CCACTRL1                    0x37
#define RSSI                        0x38
#define RSSISTAT                    0x39
#define TXFIFO_BUF                  0x3A
#define RXFIRST                     0x3C
#define RXFIFOCNT                   0x3E
#define TXFIFOCNT                   0x3F
#define CHIPID                      0x40
#define VERSION                     0x42
#define EXTCLOCK                    0x44
#define MDMCTRL0                    0x46
#define MDMCTRL1                    0x47
#define FREQEST                     0x48
#define RXCTRL                      0x4A
#define FSCTRL                      0x4C
#define FSCAL0                      0x4E
#define FSCAL1                      0x4F
#define FSCAL2                      0x50
#define FSCAL3                      0x51
#define AGCCTRL0                    0x52
#define AGCCTRL1                    0x53
#define AGCCTRL2                    0x54
#define AGCCTRL3                    0x55
#define ADCTEST0                    0x56
#define ADCTEST1                    0x57
#define ADCTEST2                    0x58
#define MSMTEST0                    0x5A
#define MSMTEST1                    0x5B
#define DACTEST0                    0x5C
#define DACTEST1                    0x5D
#define ATEST                       0x5E
#define DACTEST2                    0x5F
#define PTEST0                      0x60
#define PTEST1                      0x61
#define RESERVED                    0x62
#define DPUTEST                     0x7A
#define ACTTEST                     0x7C
#define RAM_BIST_CTRL               0x7E

