xtruong91/cc2530f256/Components/mac/low_level/srf04/dual_chip/mac_radio_defs.h
/* Clear GPIO exception in EXCFLAG1 */
#define RX_FRM_DONE_FLAG            ((1<<0)^0xFF)
#define RX_FRM_ACCEPTED_FLAG        ((1<<1)^0xFF)
#define SRC_MATCH_DONE_FLAG         ((1<<2)^0xFF)
#define SRC_MATCH_FOUND_FLAG        ((1<<3)^0xFF)
#define FIFOP_FLAG                  ((1<<4)^0xFF)
#define SFD_FLAG                    ((1<<5)^0xFF)
#define DPU_DONE_L_FLAG             ((1<<6)^0xFF)
#define DPU_DONE_H_FLAG             ((1<<7)^0xFF)

/* Clear GPIO exception in EXCFLAG2 */
#define MEMADDR_ERROR_FLAG          ((1<<0)^0xFF)
#define USAGE_ERROR_FLAG            ((1<<1)^0xFF)
#define OPERAND_ERROR_FLAG          ((1<<2)^0xFF)
#define SPI_ERROR_FLAG              ((1<<3)^0xFF)
#define RF_NO_LOCK_FLAG             ((1<<4)^0xFF)
#define RX_FRM_ABORTED_FLAG         ((1<<5)^0xFF)
#define RXBUFMOV_TIMEOUT_FLAG       ((1<<6)^0xFF)
#define UNUSED_FLAG                 ((1<<7)^0xFF)


/* ------------------------------------------------------------------------------------------------
 *                                    Unique Radio Defines
 * ------------------------------------------------------------------------------------------------
 */
#define MAC_RADIO_CC2520


/* ------------------------------------------------------------------------------------------------
 *                                    Common Radio Defines
 * ------------------------------------------------------------------------------------------------
 */
#define MAC_RADIO_CHANNEL_DEFAULT               11
#define MAC_RADIO_CHANNEL_INVALID               0xFF
#define MAC_RADIO_TX_POWER_INVALID              0xFF
#define MAC_RADIO_TX_POWER_DEFAULT              0x32


#define MAC_RADIO_RECEIVER_SENSITIVITY_DBM      -98 /* dBm */
#define MAC_RADIO_RECEIVER_SATURATION_DBM       6   /* dBm */

#define MAC_RADIO_RSSI_OFFSET                   HAL_MAC_RSSI_OFFSET

#if (defined HAL_PA_LNA || defined HAL_PA_LNA_CC2590)
#define MAC_RADIO_RSSI_LNA_HGM_OFFSET           HAL_MAC_RSSI_LNA_HGM_OFFSET
#define MAC_RADIO_RSSI_LNA_LGM_OFFSET           HAL_MAC_RSSI_LNA_LGM_OFFSET
#define MAC_RADIO_RSSI_LNA_OFFSET(x)            st(  x += macRxGain ? MAC_RADIO_RSSI_LNA_HGM_OFFSET : MAC_RADIO_RSSI_LNA_LGM_OFFSET; )
#else
#define MAC_RADIO_RSSI_LNA_OFFSET(x)
#endif


#define MAC_RADIO_RX_TX_PROP_DELAY_MIN_USEC     3.076  /* usec */
#define MAC_RADIO_RX_TX_PROP_DELAY_MAX_USEC     3.284  /* usec */


/* register value table offset */
#define MAC_RADIO_DEFS_TBL_TXPWR_FIRST_ENTRY   0
#define MAC_RADIO_DEFS_TBL_TXPWR_LAST_ENTRY    1
#define MAC_RADIO_DEFS_TBL_TXPWR_ENTRIES       2


/* ------------------------------------------------------------------------------------------------
 *                                    Common Radio Macros
 * ------------------------------------------------------------------------------------------------
 */
#define MAC_RADIO_MCU_INIT()                          macDualchipSystemInit()

#define MAC_RADIO_TURN_ON_POWER()                     macDualchipTurnOnRadioPower()
#define MAC_RADIO_TURN_OFF_POWER()                    macDualchipTurnOffRadioPower()
#define MAC_RADIO_TURN_ON_OSC()                       macDualchipTurnOnRadioOscillator()
#define MAC_RADIO_TURN_OFF_OSC()                      macDualchipTurnOffRadioOscillator()

#define MAC_RADIO_RX_FIFO_HAS_OVERFLOWED()            (HAL_MAC_READ_FIFOP_PIN() && !HAL_MAC_READ_FIFO_PIN())
#define MAC_RADIO_RX_FIFO_IS_EMPTY()                  (!HAL_MAC_READ_FIFO_PIN() && !HAL_MAC_READ_FIFOP_PIN())

#define MAC_RADIO_RSSI_IS_VALID()                     (macSpiCmdStrobe(SNOP) & RSSI_VALID)

#define MAC_RADIO_SET_RX_THRESHOLD(x)                 macSpiWriteReg(FIFOPCTRL, (x)-1)
#define MAC_RADIO_RX_IS_AT_THRESHOLD()                HAL_MAC_READ_FIFOP_PIN()
#define MAC_RADIO_ENABLE_RX_THRESHOLD_INTERRUPT()     HAL_MAC_ENABLE_FIFOP_INT()
#define MAC_RADIO_DISABLE_RX_THRESHOLD_INTERRUPT()    HAL_MAC_DISABLE_FIFOP_INT()
#define MAC_RADIO_CLEAR_RX_THRESHOLD_INTERRUPT_FLAG() HAL_MAC_CLEAR_FIFOP_INT_FLAG()

#define MAC_RADIO_TX_ACK()                            macSpiWriteReg(FRMCTRL1, FRMCTRL1_RESET_VALUE & ~PENDING_OR_BV)
#define MAC_RADIO_TX_ACK_PEND()                       macSpiWriteReg(FRMCTRL1, FRMCTRL1_RESET_VALUE | PENDING_OR_BV)
#define MAC_RADIO_RX_ON()                             macSpiCmdStrobe(SRXON)
#define MAC_RADIO_RXTX_OFF()                          macSpiCmdStrobe(SRFOFF)
#define MAC_RADIO_FLUSH_TX_FIFO()                     macSpiCmdStrobe(SFLUSHTX)
#define MAC_RADIO_FLUSH_RX_FIFO()                     st( macSpiCmdStrobe(SFLUSHRX); macSpiCmdStrobe(SFLUSHRX); )
#define MAC_RADIO_TX_IS_ACTIVE()                      (macSpiCmdStrobe(SNOP) & TX_ACTIVE)

#define MAC_RADIO_READ_RX_FIFO(pData,len)             macSpiReadRxFifo(pData, len)
#define MAC_RADIO_WRITE_TX_FIFO(pData,len)            macSpiWriteTxFifo(pData, len)

#define MAC_RADIO_SET_PAN_COORDINATOR(b)              st( if (b) { macDualchipOrFRMFILT0(PAN_COORDINATOR_BV); } else { macDualchipAndFRMFILT0(PAN_COORDINATOR_BV^0xFF); } )
#define MAC_RADIO_SET_CHANNEL(x)                      macSpiWriteReg(FREQCTRL, (FREQCTRL_BASE_VALUE + (FREQCTRL_FREQ_2405MHZ + 5 * ((x) - 11))))
#define MAC_RADIO_SET_TX_POWER(x)                     macSpiWriteReg(TXPOWER, (TXPOWER_BASE_VALUE | (x)))
#define MAC_RADIO_SELECT_BOOST_MODE(x)

#define MAC_RADIO_SELECT_PTABLE(PTABLE)               st( MAC_RADIO_SELECT_PTABLE_CC2520((PTABLE));)

#if defined MAC_RUNTIME_CC2591 || defined MAC_RUNTIME_CC2590

#define MAC_RADIO_SELECT_PTABLE_CC2520(PTABLE) \
  st( (PTABLE) = macRadioDefsTxPwrTables[macRadioDefsRefTableId >> 4]; )

#elif defined HAL_PA_LNA || defined HAL_PA_LNA_CC2590

#define MAC_RADIO_SELECT_PTABLE_CC2520(PTABLE) \
  st( (PTABLE) = macRadioDefsTxPwrTables[0]; )

#else

#define MAC_RADIO_SELECT_PTABLE_CC2520(PTABLE) \
  st( (PTABLE) = macRadioDefsTxPwrBare; )

#endif
    
# define MAC_RADIO_SENSITIVITY_OFFSET(x)
# define MAC_RADIO_SATURATION_OFFSET(x) 

#define MAC_RADIO_SET_PAN_ID(x)                       macSpiWriteRamUint16(RAM_PANID, x)
#define MAC_RADIO_SET_SHORT_ADDR(x)                   macSpiWriteRamUint16(RAM_SHORTADR, x)
#define MAC_RADIO_SET_IEEE_ADDR(p)                    macSpiWriteRam(RAM_IEEEADR, p, 8)

#define MAC_RADIO_REQUEST_ACK_TX_DONE_CALLBACK()      /* nothing required */
#define MAC_RADIO_CANCEL_ACK_TX_DONE_CALLBACK()       /* nothing required */
    
#define MAC_RADIO_TURN_ON_AUTOPEND_DATAREQ_ONLY()     /* SRCMATCH_RESET_VALUE already includes this*/
 
#define MAC_RADIO_RANDOM_BYTE()                       macDualchipRandomByte()
#define MAC_RADIO_RANDOM_WORD()                       macDualchipRandomWord()

#define MAC_RADIO_TX_RESET()                          macDualchipTxReset()
#define MAC_RADIO_TX_PREP_CSMA_UNSLOTTED()            /* nothing required */
#define MAC_RADIO_TX_PREP_CSMA_SLOTTED()              macDualchipTxPrepCsmaSlotted()
#define MAC_RADIO_TX_PREP_SLOTTED()                   macDualchipTxPrepSlotted()
#define MAC_RADIO_TX_PREP_GREEN_POWER()               /* Green Power is not supported on CC2520 yet */
#define MAC_RADIO_TX_GO_CSMA()                        macDualchipTxGoCsma()
#define MAC_RADIO_TX_GO_SLOTTED_CSMA()                macDualchipTxGoSlottedCsma()
#define MAC_RADIO_TX_GO_SLOTTED()                     macDualchipTxGoSlotted()
#define MAC_RADIO_TX_GO_GREEN_POWER()                 /* Green Power is not supported on CC2520 yet */

