xtruong91/cc2530f256/Components/mac/low_level/srf04/dual_chip/mac_radio_defs.h
#define MAC_RADIO_FORCE_TX_DONE_IF_PENDING()          /* nothing required */

#define MAC_RADIO_TX_REQUEST_ACK_TIMEOUT_CALLBACK()   macDualchipTxRequestAckTimeoutCallback()
#define MAC_RADIO_TX_CANCEL_ACK_TIMEOUT_CALLBACK()    macDualchipTxCancelAckTimeoutCallback()

#define MAC_RADIO_TIMER_TICKS_PER_USEC()              HAL_MAC_TIMER_TICKS_PER_USEC /* may be fractional */
#define MAC_RADIO_TIMER_TICKS_PER_BACKOFF()           ((uint16) (HAL_MAC_TIMER_TICKS_PER_USEC * MAC_SPEC_USECS_PER_BACKOFF + 0.5))
#define MAC_RADIO_TIMER_TICKS_PER_SYMBOL()            ((uint16) (HAL_MAC_TIMER_TICKS_PER_USEC * MAC_SPEC_USECS_PER_SYMBOL + 0.5))

#define MAC_RADIO_TIMER_CAPTURE()                     macMcuTimerTickCapture()
#define MAC_RADIO_TIMER_FORCE_DELAY(x)                macMcuTimerForceDelay(x)

#define MAC_RADIO_TIMER_SLEEP()                       st( if (macPib.beaconOrder == MAC_BO_NON_BEACON) \
                                                            HAL_MAC_TIMER_ROLLOVER_DISABLE_INTERRUPT(); )
#define MAC_RADIO_TIMER_WAKE_UP()                     st( if (macPib.beaconOrder == MAC_BO_NON_BEACON) \
                                                            HAL_MAC_TIMER_ROLLOVER_ENABLE_INTERRUPT(); )

#define MAC_RADIO_BACKOFF_COUNT()                     macMcuTimerBackoffCount
#define MAC_RADIO_BACKOFF_CAPTURE()                   macMcuTimerBackoffCapture()
#define MAC_RADIO_BACKOFF_SET_COUNT(x)                st( macMcuTimerBackoffCount = x; )
#define MAC_RADIO_BACKOFF_SET_COMPARE(x)              st( macMcuTimerBackoffCompare = x; )

#define MAC_RADIO_BACKOFF_COMPARE_CLEAR_INTERRUPT()   HAL_MAC_TIMER_ROLLOVER_CLEAR_INTERRUPT()
#define MAC_RADIO_BACKOFF_COMPARE_ENABLE_INTERRUPT()  HAL_MAC_TIMER_ROLLOVER_ENABLE_INTERRUPT()
#define MAC_RADIO_BACKOFF_COMPARE_DISABLE_INTERRUPT() HAL_MAC_TIMER_ROLLOVER_DISABLE_INTERRUPT()

#define MAC_RADIO_BACKOFF_SET_PERIOD(x)               st( macMcuTimerBackoffRollover = x; )
#define MAC_RADIO_BACKOFF_PERIOD_CLEAR_INTERRUPT()    /* nothing required */
#define MAC_RADIO_BACKOFF_PERIOD_ENABLE_INTERRUPT()   /* nothing required */
#define MAC_RADIO_BACKOFF_PERIOD_DISABLE_INTERRUPT()  /* nothing required */

#define MAC_RADIO_RECORD_MAX_RSSI_START()             macDualchipRecordMaxRssiStart()
#define MAC_RADIO_RECORD_MAX_RSSI_STOP()              macDualchipRecordMaxRssiStop()

#define MAC_RADIO_TURN_ON_RX_FRAME_FILTERING()        macDualchipOrFRMFILT0(ADR_DECODE_BV | MAX_FRAME_VERSION)
#define MAC_RADIO_TURN_OFF_RX_FRAME_FILTERING()       macDualchipAndFRMFILT0(ADR_DECODE_BV^0xFF)

#define MAC_RADIO_TURN_ON_AUTO_ACK()                  macSpiWriteReg(FRMCTRL0, (FRMCTRL0_RESET_VALUE | AUTOACK_BV));
#define MAC_RADIO_TURN_OFF_SRC_MATCH()                macSpiWriteReg(SRCMATCH, SRCMATCH_RESET_VALUE & ~SRC_MATCH_EN);
#define MAC_RADIO_TURN_ON_SRC_MATCH()                 macSpiWriteReg(SRCMATCH, SRCMATCH_RESET_VALUE);
#define MAC_RADIO_TURN_ON_AUTOPEND()                  macSpiWriteReg(SRCMATCH, SRCMATCH_RESET_VALUE);
#define MAC_RADIO_SRC_MATCH_RESULT()                  MAC_SrcMatchCheckResult()
#define MAC_RADIO_SRC_MATCH_RESINDEX(p)               macSpiReadRam(SRCRESINDEX, &(p), 1)

#define MAC_RADIO_TX_ACK_DONE_EXCEPTION(x)            ( x &  TX_ACK_DONE_BIT)
#define MAC_RADIO_TX_FRM_DONE_EXCEPTION(x)            ( x &  TX_FRM_DONE_BIT)
#define MAC_RADIO_TX_ACK_AND_TX_FRM_DONE_EXCEPTION(x) ((x & (TX_ACK_DONE_BIT | TX_FRM_DONE_BIT)) == (TX_ACK_DONE_BIT | TX_FRM_DONE_BIT))

#define MAC_RADIO_CLEAR_TX_ACK_DONE_PIN()             macSpiWriteReg(EXCFLAG0,  TX_ACK_DONE_FLAG)
#define MAC_RADIO_CLEAR_TX_FRM_DONE_PIN()             macSpiWriteReg(EXCFLAG0,  TX_FRM_DONE_FLAG)
#define MAC_RADIO_CLEAR_TX_ACK_AND_TX_FRM_DONE_PIN()  macSpiWriteReg(EXCFLAG0, (TX_ACK_DONE_FLAG & TX_FRM_DONE_FLAG))

#define MAC_RADIO_CANCEL_TX_ACK()                     macSpiCmdStrobe(SNACK)

#define MAC_RADIO_CONFIG_TRIGGER_CCA()                st( HAL_MAC_CONFIG_TRIGGER_PIN_AS_OUTPUT(); \
                                                          macSpiWriteReg( GPIOCTRL3, GPIO_DIR_RADIO_OUTPUT | EXCEPTION_RFC_CCA ); );
#define MAC_RADIO_SET_TRIGGER_STXON()                 st( macSpiWriteReg( GPIOCTRL5, GPIO_DIR_RADIO_INPUT  | GPIO_CMD_STXON ); )
#define MAC_RADIO_SET_TRIGGER_STXONCCA()              st( macSpiWriteReg( GPIOCTRL5, GPIO_DIR_RADIO_INPUT  | GPIO_CMD_STXONCCA ); )

#define MAC_RADIO_READ_SAMPLED_CCA()                  (SAMPLED_CCA_BV & macSpiReadReg( FSMSTAT1 ))

/* ------------Source Matching --------- */

#define MAC_RADIO_TURN_ON_PENDING_OR()                macSpiWriteReg(FRMCTRL1, FRMCTRL1_RESET_VALUE | PENDING_OR_BV)
#define MAC_RADIO_TURN_OFF_PENDING_OR()               macSpiWriteReg(FRMCTRL1, FRMCTRL1_RESET_VALUE & ~PENDING_OR_BV)
#define MAC_RADIO_READ_PENDING_OR()                   ( macSpiReadReg(FRMCTRL1) & PENDING_OR_BV )

#define MAC_RADIO_SRC_MATCH_GET_SHORTADDR_EN()        macSrcMatchGetShortAddrEnableBit()
#define MAC_RADIO_SRC_MATCH_GET_EXTADDR_EN()          macSrcMatchGetExtAddrEnableBit()
#define MAC_RADIO_SRC_MATCH_GET_SHORTADDR_PENDEN()    macSrcMatchGetShortAddrPendEnBit()
#define MAC_RADIO_SRC_MATCH_GET_EXTADDR_PENDEN()      macSrcMatchGetExtAddrPendEnBit()

#define MAC_RADIO_GET_SRC_SHORTEN(p)                  st( p[0] = macSpiReadReg(SRCSHORTEN0); \
                                                          p[1] = macSpiReadReg(SRCSHORTEN1); \
                                                          p[2] = macSpiReadReg(SRCSHORTEN2); )

#define MAC_RADIO_GET_SRC_EXTEN(p)                    st( p[0] = macSpiReadReg(SRCEXTEN0); \
                                                          p[1] = macSpiReadReg(SRCEXTEN1); \
                                                          p[2] = macSpiReadReg(SRCEXTEN2); )

#define MAC_RADIO_GET_SRC_SHORTPENDEN(p)              macSpiReadRam(SRCSHORTPENDEN0, (p), 3)
#define MAC_RADIO_GET_SRC_EXTENPEND(p)                macSpiReadRam(SRCEXTPENDEN0, (p), 3)

#define MAC_RADIO_SRC_MATCH_SET_SHORTPENDEN(p)        macSpiWriteRam(SRCSHORTPENDEN0, (p), 3)

#define MAC_RADIO_SRC_MATCH_SET_EXTPENDEN(p)          macSpiWriteRam(SRCEXTPENDEN0, (p), 3)

#define MAC_RADIO_SRC_MATCH_SET_SHORTEN(x)            st( macSpiWriteReg(SRCSHORTEN0, BREAK_UINT32((x), 0)); \
                                                          macSpiWriteReg(SRCSHORTEN1, BREAK_UINT32((x), 1)); \
                                                          macSpiWriteReg(SRCSHORTEN2, BREAK_UINT32((x), 2)); )

#define MAC_RADIO_SRC_MATCH_SET_EXTEN(x)              st( macSpiWriteReg(SRCEXTEN0, BREAK_UINT32((x), 0)); \
                                                          macSpiWriteReg(SRCEXTEN1, BREAK_UINT32((x), 1)); \
                                                          macSpiWriteReg(SRCEXTEN2, BREAK_UINT32((x), 2)); )

#define MAC_RADIO_SRC_MATCH_TABLE_WRITE(offset, p, len)  macSpiWriteRam( SRC_MATCH_TABLE + (offset), (p), (len))
#define MAC_RADIO_SRC_MATCH_TABLE_READ(offset, p, len)   macSpiReadRam( SRC_MATCH_TABLE + (offset), (p), (len))


#if defined(HAL_BOARD_F5438) || defined(HAL_BOARD_LM3S)
#define HAL_MAC_CONFIG_SNIFFER_MODE_PINS()            /* nothing required */
#else
#define HAL_MAC_CONFIG_SNIFFER_MODE_PINS()            st( HAL_MAC_CONFIG_TRIGGER_PIN_AS_INTPUT(); \
                                                          macSpiWriteReg( GPIOCTRL3, GPIO_DIR_RADIO_OUTPUT | EXCEPTION_RFC_SNIFFER_DATA ); \
                                                          macSpiWriteReg( GPIOCTRL5, GPIO_DIR_RADIO_OUTPUT | EXCEPTION_RFC_SNIFFER_CLK ); )
#endif


/* ----------- PA/LNA control ---------- */
#if (defined HAL_PA_LNA || defined HAL_PA_LNA_CC2590)
#define HAL_PA_LNA_RX_HGM()                           st( macSpiWriteReg( GPIOCTRL3, GPIO_DIR_RADIO_OUTPUT | 0x7F ); macRxGain = 1; )
#define HAL_PA_LNA_RX_LGM()                           st( macSpiWriteReg( GPIOCTRL3, GPIO_DIR_RADIO_OUTPUT | 0x7E ); macRxGain = 0; )
#define HAL_PA_LNA_RX_GAIN()                          ( macRxGain )
#endif

/* Stubs for CC2591 compression workaround */
#define COMPRESSION_WORKAROUND_ON()                   /* Nothing */
#define COMPRESSION_WORKAROUND_OFF()                  /* Nothing */
#define COMPRESSION_WORKAROUND_RESET_RSSI()           /* Nothing */


/* ------------------------------------------------------------------------------------------------
 *                                    Common Radio Externs
 * ------------------------------------------------------------------------------------------------
 */
extern const uint8 CODE *const CODE macRadioDefsTxPwrTables[];
extern const uint8 CODE macRadioDefsTxPwrBare[];


/* ------------------------------------------------------------------------------------------------
 *                              Transmit Power Setting Configuration
 * ------------------------------------------------------------------------------------------------
 */

/*
 *  To use actual register values for setting power level, delete the 'x' from the following #define.
 *  In this case, the value passed to the set power function will be written directly to the
 *  LOWER BYTE of TXCTRL.  Characterized values for this register can be found in the datasheet
 *  in the "power settings" table.
 *
 *  NOTE!  The table gives the full value for TXCTRL, for example the register value
 *        for -7 dbm is 0xA0EF.  Only the lower byte is written so, in this case, use 0xEF for
 *        the regsiter value.
 */
#define xHAL_MAC_USE_REGISTER_POWER_VALUES


/**************************************************************************************************
 */
#endif
